Revit 2026 API

# ElementTypeName Property

---

Set the name for the ElementType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override string Name { set; }
```
```vb
Public Overrides WriteOnly Property Name As String
	Set
```
```cpp
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```
```fsharp
abstract Name : string with set
override Name : string with set
```

#### Property Value

String

This method will assign the element type a new name.

#### Reference

ElementType Class

Autodesk.Revit.DB Namespace